{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Введите числа через пробел:\n",
      "2 7 6 8 10 15 25\n",
      "Введите искомое число:\n",
      "13\n",
      "Искомый элемент не содержится в списке, но        \n",
      "Индекс элемента меньше искомого 5        \n",
      "Индекс элемента больше искомого 4\n"
     ]
    }
   ],
   "source": [
    "\"\"\"\n",
    "Входные данные:\n",
    "напишите программу, которой на вход подается последовательность чисел через пробел, а также \n",
    "запрашивается у пользователя любое число (target).\n",
    "Далее программа работает по следующему алгоритму:\n",
    "1. Преобразовать последовательность в список (Python list);\n",
    "2. Сортировка списка по возрастанию элементов в нем;\n",
    "3. Устанавливается номер позиции элемента, который меньше введенного пользователем числа, а \n",
    "следующий за ним больше или равен этому числу;\n",
    "4. Реализовать функцию binary search.\n",
    "Вывод (результат работы программы):\n",
    "1. Индекс элемента (номер позиции элемента) < target;\n",
    "2. Индекс элемента (номер позиции элемента) >= target;\n",
    "3. Вывести сообщение, если есть числа, которые могут не соответствовать заданному условию.\n",
    "Примечание!\n",
    "Так как в задании ничего не сказано о том,\n",
    "должны ли быть индексы из оригинального или из отсортированного списка, то\n",
    "будем выводить индексы из отсортированного списка\n",
    "\"\"\"\n",
    "\n",
    "\n",
    "def insert_sort(array: list) -> list:\n",
    "    for i in range(len(array)):\n",
    "        current = array[i]\n",
    "        indx = i\n",
    "        while indx > 0 and array[indx - 1] > current:\n",
    "            array[indx] = array[indx - 1]\n",
    "            indx -= 1\n",
    "        array[indx] = current\n",
    "    return array\n",
    "\n",
    "\n",
    "# применим алгорит двоичного поиска\n",
    "def binary_search(array: list, target: int):\n",
    "    low = 0\n",
    "    high = len(array) - 1\n",
    "    # Если искомого элемента (target) нет в спиксе, ищем его в словаре (nearest) с ближайщими элементами\n",
    "    nearest = {}  # индекс: разность между искомым и текущим элементами\n",
    "\n",
    "    while low <= high:\n",
    "        mid = (low + high) // 2\n",
    "        if target == array[mid]:\n",
    "            print(f\"Индекс элемента меньшего искомого {mid - 1}\\\n",
    "                \\nИндекс искомого элемента {mid}\")\n",
    "            return True\n",
    "        elif target < array[mid]:\n",
    "            nearest[mid] = (target - array[mid])\n",
    "            high = mid - 1\n",
    "        else:\n",
    "            nearest[mid] = (target - array[mid])\n",
    "            low = mid + 1\n",
    "    nearest_indexes(nearest)\n",
    "\n",
    "\n",
    "# Если искомого элемента (target) нет в списке, то мы ищем ближайшее\n",
    "def nearest_indexes(pairs: dict):\n",
    "    keys = list(pairs.keys())\n",
    "    low = keys[-2]\n",
    "    hight = keys[-1]\n",
    "    print(f\"Искомый элемент не содержится в списке, но\\\n",
    "        \\nИндекс элемента меньше искомого {low}\\\n",
    "        \\nИндекс элемента больше искомого {hight}\")\n",
    "\n",
    "\n",
    "try:\n",
    "    data = [int(i) for i in input(\"Введите числа через пробел:\\n\").split()]\n",
    "    n = int(input(\"Введите искомое число:\\n\"))\n",
    "except TypeError:\n",
    "    print(\"Вводимая строка должна состоять только из чисел\") # проверка, что введены именно числа\n",
    "\n",
    "\n",
    "data = insert_sort(data)\n",
    "if n == data[0]:\n",
    "    print(\"Искомый элемент является минимальным в списке\")\n",
    "elif n < data[0]:\n",
    "    print(\"Искомый элемент меньше минимального в списке\")\n",
    "elif n == data[-1]:\n",
    "    print(\"Искомый элемент является максимальным в списке\")\n",
    "elif n > data[-1]:\n",
    "    print(\"Искомый элемент больше максимального в списке\")\n",
    "else:\n",
    "    binary_search(data, n)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
